{
    "title": "Quest for Book",
	"follower_id": "BOOK",
    "dialogs": {
        "not_active": [
            {
                "entry": true,
                "label": "start",
                "text": "\"Good day, fellow com-rat! I am com-rat Ratsky.\nIt is my greatest pleasure to meet a fellow revolutionary.\nAnd a great friend of the working rat I am sure.\"",
                "responses": [
                    {
                        "text": "\"Good day! How is a fellow com-rat doing?\"",
						"next_label": "ask_question"
                    },
                    {
                        "text": "\"Hello, com-rat! I don't have much time.\nI have revolution to organize.\"",
						"next_label": "ask_question"
                    }
                ]
            },
			{
                "label": "ask_question",
                "text": "\"I am very sorry com-rat. I know you must be busy.\nHowever, the only copy of the Com-rat Manifesto was taken by\nthe cats.How, can we ever build a rat-topia without its guidelines?\"",
                "responses": [
                    {
                        "text": "\"I will go look for it immediately\nThe history of all rat society is a struggle\nbetween the rat and the cat. - Right?\"",
                        "next_label": "accepted"
                    },
                    {
                        "text": "\"The rat-topia is in every rats heart.\nWe dont need no book!\"",
                        "next_label": "rejected"
                    }
                ]
            },
            {
                "label": "rejected",
                "text": "\"My heart hopes you are right.\nBut my head knows we need the Book!\""                
            },
            {
                "label": "accepted",
                "text": "\"I see you are familiar with the Com-rat Manifesto.\nSee that you find it quickly, lest the cats burn it out of fear and ignorance.\"",
                "next_state": "active"
            }
        ],
        "active": [
            {
                "entry": true,
                "label": "just_checking",
                "text": "\"How you found it yet?\nI fear the cats might destroy the Book.\nIt is the only copy we have.\"",
                "responses": [
                    {
                        "conditional_item": "BOOK",
                        "text": "\"Here it is. Keep it safe this time around.\"",
                        "next_label": "quest_finished"
                    },
                    {
                        "text": "\"Still working on it.\""                        
                    }
                ]
            },
            {
                "label": "quest_finished",
                "text": "\"Yes, Yes, I will. I will also start writing speeches immediately!\nThank you com-rat! A working rat's paradise is one step closer.\"",
                "next_state": "done"
            }
        ],
        "done": [
            {
                "entry": true,
                "label": "nothing_to_see",
                "text": "\"What do you think - Let the cats tremble before the com-rat revolution! \nThe rats have nothing to lose but their chains. They have a world to win. -\nI think it would work nicely in your revolutionary speech!\""                
            }
        ]
    }
}